name: "codegen"
platform: "onnxruntime_onnx"
max_batch_size: 1
input: [
  {
    name: "input_ids",
    data_type: TYPE_INT32,
    dims: [512]
  },
  {
    name: "attention_mask", 
    data_type: TYPE_INT32,
    dims: [512]
  }
]
output: [
  {
    name: "output_0",
    data_type: TYPE_FP32,
    dims: [512]
  }
]