name: "codegen"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [1, 2500]
  },
  {
    name: "attention_mask" 
    data_type: TYPE_INT32
    dims: [1, 2500]
  }
]
output [
  {
    name: "output_0"
    data_type: TYPE_INT32
    dims: [1, 2500]
  }
]
instance_group [
  {
    kind: KIND_CPU
  }
]
